this.model.NatureWarrior = { "dID": "NatureWarrior", "name": "自然战士","index":"1088","translate":"冬日咕咕酱",
    "x1": {
        "abil_name": "自然战士",
        "required": 0,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "在此树中每花费1AP，+1HP。"
        }
    }, "x2": {
        "abil_name": "战斗本能",
        "required": 5,
        "prereq": "x1",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "狼形态时获得：+1d6偷袭,+1近战伤害。</br>熊形态时获得：+5PRR,+1近战伤害。+10正/负能量法术强度。"
        }
    }, "x3": {
        "abil_name": "战斗本能",
        "required": 10,
        "prereq": "x2",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "狼形态时获得：+1d6偷袭,+1近战伤害。</br>熊形态时获得：+5PRR,+1近战伤害。"
        }
    }, "x4": {
        "abil_name": "战斗本能",
        "required": 20,
        "prereq": "x3",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "狼形态时获得：+1d6偷袭,+1近战伤害。</br>熊形态时获得：+5PRR,+1近战伤害。"
        }
    }, "x5": {
        "abil_name": "战斗本能",
        "required": 30,
        "prereq": "x4",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "狼形态时获得：+1d6偷袭,+1近战伤害。</br>熊形态时获得：+5PRR,+1近战伤害。"
        }
    }, "x6": {
        "abil_name": "自然战士",
        "required": 40,
        "prereq": "x5",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "+1力量，敏捷，体质。+2唬骗。+2威吓。</br>狼形态时获得：+2近战伤害,+2d6偷袭，+10PRR.</br>   熊形态时获得：+2近战伤害,+15%攻击速度，+10PRR。"
        }
    }, "1a": {
        "abil_name": "额外理解动物",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1理解动物和精通理解动物使用次数。+5正能量法术强度。",
            "2": "+2理解动物和精通理解动物使用次数。+10正能量法术强度。",
            "3": "+3理解动物和精通理解动物使用次数。+15正能量法术强度。"
        }
    }, "1b": {
        "abil_name": "激怒",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "敌人的恐惧激励着你。每当你使用威吓时，你将在威吓效果的时间内获得2DR。",
            "2": "敌人的恐惧激励着你。每当你使用威吓时，你将在威吓效果的时间内获得4DR。",
            "3": "敌人的恐惧激励着你。每当你使用威吓时，你将在威吓效果的时间内获得6DR。"
        }
    }, "1c": {
        "abil_name": "野兽天性-野兽姿态",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "将自己迷失在野兽天性中。当这项姿态开启时，你在强韧和反射豁免上获得+1豁免，你受到-2意志豁免的惩罚。（Bug:开启其他野兽姿态不会关闭野兽天性。）",
            "2": "将自己迷失在野兽天性中。当这项姿态开启时，你在强韧和反射豁免上获得+2豁免，你受到-2意志豁免的惩罚。（Bug:开启其他野兽姿态不会关闭野兽天性。）",
            "3": "将自己迷失在野兽天性中。当这项姿态开启时，你在强韧和反射豁免上获得+3豁免，你受到-2意志豁免的惩罚。（Bug:开启其他野兽姿态不会关闭野兽天性。）"
        }
    }, "1d": {
        "abil_name": "不定角度",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你以欺骗性地步法移动。当你唬骗一个敌人、或者使用其他激活唬骗的能力时，那个敌人遭到-2AC惩罚。",
            "2": "你以欺骗性地步法移动。当你唬骗一个敌人、或者使用其他激活唬骗的能力时，那个敌人遭到-4AC惩罚。",
            "3": "你以欺骗性地步法移动。当你唬骗一个敌人、或者使用其他激活唬骗的能力时，那个敌人遭到-6AC惩罚。"
        }
    }, "1e": {
        "abil_name": "运动员",
        "required": 1,
        "prereq": null,
        "passive": "passive",
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1平衡，跳跃，游泳以及翻滚。",
            "2": "+2平衡，跳跃，游泳以及翻滚。",
            "3": "+3平衡，跳跃，游泳以及翻滚。Rank3：获得一次额外的理解动物和精通理解动物。"
        }
    }, "2a": {
        "abil_name": "迁徙",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "在12s内获得10%闪避。（消耗1次理解动物，冷却时间90s)",
            "2": "在24s内获得10%闪避。（消耗1次理解动物，冷却时间90s)",
            "3": "在36s内获得10%闪避。（消耗1次理解动物，冷却时间90s)"
        }
    }, "2b": {
        "abil_name": "复仇猎手",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "和你的敌人交手将磨利你的尖牙和利爪。你重击之后将在20秒内获得+2重击伤害。被敌人击中后也将有5%几率获得这个效果。这个效果可以叠加1次，最多+2重击伤害。",
            "2": "和你的敌人交手将磨利你的尖牙和利爪。你重击之后将在20秒内获得+2重击伤害。被敌人击中后也将有5%几率获得这个效果。这个效果可以叠加2次，最多+4重击伤害。",
            "3": "和你的敌人交手将磨利你的尖牙和利爪。你重击之后将在20秒内获得+2重击伤害。被敌人击中后也将有5%几率获得这个效果。这个效果可以叠加3次，最多+6重击伤害。"
        }
    }, "2c": {
        "abil_name": "鳄鱼皮",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的皮肤变厚变硬，一股傲慢地鳄鱼自信充满你全身,启动这项能力将在8秒内减少你受到的40%物理和酸伤害。（冷却：5min)",
            "2": "你的皮肤变厚变硬，一股傲慢地鳄鱼自信充满你全身,启动这项能力将在8秒内减少你受到的50%物理和酸伤害。（冷却：5min)",
            "3": "你的皮肤变厚变硬，一股傲慢地鳄鱼自信充满你全身,启动这项能力将在8秒内减少你受到的60%物理和酸伤害。（冷却：5min)"
        }
    }, "2d": {
        "abil_name": "血月暴怒",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的狼群尝到了血的滋味。杀死一个敌人将提供给你的雇佣兵、宠物、召唤生物以及魅惑的怪物持续15秒的20%移动速度上的增强加值，以及10%增强攻击速度加值。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "2": "你的狼群尝到了血的滋味。杀死一个敌人将提供给你的雇佣兵、宠物、召唤生物以及魅惑的怪物持续15秒的30%移动速度上的增强加值，以及15%增强攻击速度加值。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "3": "你的狼群尝到了血的滋味。杀死一个敌人将提供给你的雇佣兵、宠物、召唤生物以及魅惑的怪物持续15秒的40%移动速度上的增强加值，以及20%增强攻击速度加值。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。"
        }
    }, "2e": {
        "abil_name": "行动提升：双击",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "激活这个能力在20秒内获得10%行动提升加值的双击",
            "2": "激活这个能力在20秒内获得20%行动提升加值的双击",
            "3": "激活这个能力在20秒内获得30%行动提升加值的双击"
        }
    }, "3a": {
        "abil_name": "战斗",
        "required": 10,
        "prereq": "2a",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "在任何狼和熊形态下获得+1近战伤害，+1AC。",
            "2": "在任何狼和熊形态下获得+2近战伤害，+2AC。",
            "3": "在任何狼和熊形态下获得+3近战伤害，+3AC。"
        }
    }, "3b": {
        "abil_name": "掠命怒吼:野兽姿态",
        "required": 10,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当此种野兽姿态开启时，杀死一个敌人将会提供给你持续10秒的2%能力加值的仇恨提升，并且杀死一个怪物将造成5D6音波范围伤害。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "2": "当此种野兽姿态开启时，杀死一个敌人将会提供给你持续10秒的4%能力加值的仇恨提升，并且杀死一个怪物将造成5D6音波范围伤害。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "3": "当此种野兽姿态开启时，杀死一个敌人将会提供给你持续10秒的6%能力加值的仇恨提升，并且杀死一个怪物将造成5D6音波范围伤害。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。"
        }
    }, "3c": {
        "abil_name": "精通闪避",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "在任何狼和熊形态下获得+1闪避。",
            "2": "在任何狼和熊形态下获得+2闪避。",
            "3": "在任何狼和熊形态下获得+3闪避。"
        }
    }, "3d": {
        "abil_name": "致命掠食者:野兽姿态",
        "required": 10,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "杀死一个敌人将会给予你持续8秒的5%攻速加成。这项能力可以叠加1次。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "2": "杀死一个敌人将会给予你持续8秒的5%攻速加成。这项能力可以叠加3次。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。",
            "3": "杀死一个敌人将会给予你持续8秒的5%攻速加成。这项能力可以叠加5次。杀死那些和你等级相同或者更高的敌人将100%激活这个能力，每个低于你等级的怪物将减少20%激活几率。"
        }
    }, "3e": {
        "abil_name": "力量或感知",
        "required": 10,
        "prereq": null,
        "passive": "passive",
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1感知"
            }
        }
    }, "4b": {
        "abil_name": "乌龟精华",
        "required": 20,
        "prereq": null,
        "passive": false,
        "ranks": 2,
        "AP": 1,
        "abil": {
            "1": "敌人的攻击将给予你继续战斗的决心。每当任何敌人击中处于任何熊状态下的你时，你将有5%几率获得持续8秒的10点临时法力值。",
            "2": "敌人的攻击将给予你继续战斗的决心。每当任何敌人击中处于任何熊状态下的你时，你将有5%几率获得持续8秒的20点临时法力值。"
        }
    }, "4c": {
        "abil_name": "稳固四肢：野兽姿态",
        "required": 20,
        "prereq": "3c",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你免疫大多数击倒效果。需要：狼、熊或树形态。"
        }
    }, "4d": {
        "abil_name": "伯劳精华",
        "required": 20,
        "prereq": null,
        "passive": true,
        "ranks": 2,
        "AP": 1,
        "abil": {
            "1": "攻击将集中你的心灵和身体。当你在任何狼形态下对一个敌人造成重击时，你获得持续8秒的10点临时法力值。",
            "2": "攻击将集中你的心灵和身体。当你在任何狼形态下对一个敌人造成重击时，你获得持续8秒的20点临时法力值。"
        }
    }, "4e": {
        "abil_name": "力量或感知",
        "required": 20,
        "prereq": "3e",
        "passive": "passive",
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1感知"
            }
        }
    }, "5a": {
        "abil_name": "首领之击",
        "required": 30,
        "prereq": "3a",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "范围近战攻击：你为狼群的领导地位而战。范围近战攻击造成+3W点额外伤害。这个伤害可以双击。对元素/动物/魔法兽/昆虫/动物造成额外3D6挥砍伤害。需要任何狼/熊/树形态。（消耗 6法力值。冷却时间:18s）",
            "2": "范围近战攻击：你为狼群的领导地位而战。范围近战攻击造成+6W点额外伤害。这个伤害可以双击。对元素/动物/魔法兽/昆虫/动物造成额外6D6挥砍伤害。需要任何狼/熊/树形态。（消耗 9法力值。冷却时间:15s）",
            "3": "范围近战攻击：你为狼群的领导地位而战。范围近战攻击造成+10W点额外伤害。这个伤害可以双击。对元素/动物/魔法兽/昆虫/动物造成额外10D6挥砍伤害。需要任何狼/熊/树形态。（消耗 12法力值。冷却时间:12s）"
        }
    }, "5b": {
        "abil_name": "野性医疗",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "即使身负创伤，你也是活力的源泉。当你被攻击时有5%几率获得10点临时生命值和10%士气加值的医疗放大。",
            "2": "即使身负创伤，你也是活力的源泉。当你被攻击时有5%几率获得15点临时生命值和15%士气加值的医疗放大。",
            "3": "即使身负创伤，你也是活力的源泉。当你被攻击时有5%几率获得20点临时生命值和20%士气加值的医疗放大。"
        }
    }, "5d": {
        "abil_name": "神速",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的攻击就像暴雨中猛烈的雨滴。激活这个能力将给予你持续15秒的30%增强加值的双击。（冷却时间:5min）需要：任何熊、狼或者树形态。",
            "2": "你的攻击就像暴雨中猛烈的雨滴。激活这个能力将给予你持续15秒的40%增强加值的双击。（冷却时间:5min）需要：任何熊、狼或者树形态。",
            "3": "你的攻击就像暴雨中猛烈的雨滴。激活这个能力将给予你持续15秒的50%增强加值的双击。（冷却时间:5min）需要：任何熊、狼或者树形态。"
        }
    }, "5e": {
        "abil_name": "自然使者：",
        "required": 30,
        "prereq": null,
        "passive": "passive",
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你精通在动物形态下使用神圣魔法的技艺，而且运用神圣魔法在战斗中增强你的身体。当你在任何动物形态下，你所有的非动物形态法术的冷却时间将从2.5倍于普通时间变为1.5倍于普通时间。"
        }

    }}
