this.model.RadiantServant = {"dID": "RadiantServant", "name": "光辉侍从", "index": "612", "translate": "冬日咕咕酱",
    "x1": {
        "abil_name": "治疗领域",
        "required": 0,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "每一点花费在此树种的AP将提供给你0.5通用法术强度和1点正能量法术强度。"
        }
    }, "x2": {
        "abil_name": "和平主义",
        "required": 5,
        "prereq": "x1",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "开启：你获得+25正能量法术强度以及3%正能量法术重击几率，但是你其他的法术强度减少50点、并且其他法术不能重击，同时你造成-1[W]的近战伤害。"
        }
    }, "x3": {
        "abil_name": "圣力引导:正能量爆发",
        "required": 10,
        "prereq": "x2",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "被动:你获得+1%正能量法术重击几率。" +
                "</br>主动:一股正能量波动从施法者体内涌出，对周围友军治疗1D8+1每牧师等级的生命值，同时移除1D4负向等级和1D6属性伤害。" +
                "不死生物将会被正能量伤害，受到1D8每牧师等级的伤害——一个成功的意志豁免将使伤害减半。（" +
                "支持的超魔专长：法术强效，治疗强效，法术极效，法术瞬发。法术抗力：是。）"
        }
    }, "x4": {
        "abil_name": "高等医疗强效",
        "required": 20,
        "prereq": "x3",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你获得+1%正能量法术重击几率。医疗强效专长现在将给予你+100点正能量法术强度。"
        }
    }, "x5": {
        "abil_name": "圣力引导:正能量护盾",
        "required": 30,
        "prereq": "x4",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "被动:你获得+1%正能量法术重击几率。" +
                "</br>主动:你的活体友军将收到与你医疗技能相同的暂时生命值。当这些暂时生命值存在时，你的目标获得+10%神圣加值的治疗放大。（冷却时间：30s）"
        }
    }, "x6": {
        "abil_name": "光辉侍从",
        "required": 40,
        "prereq": "x5",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你获得+2感知。每5次你施展的正能量法术将造成最大治疗效果，以及将获得+50%法术重击几率。"
        }
    }, "1a": {
        "abil_name": "额外驱散",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1驱散次数。",
            "2": "+2驱散次数。",
            "3": "+3驱散次数。"
        }
    }, "1b": {
        "abil_name": "卷轴和魔杖精通",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+25%你使用的魔杖、卷轴以及其他储法物品的效果，同时你攻击型魔杖将获得+1法术难度。",
            "2": "+50%你使用的魔杖、卷轴以及其他储法物品的效果，同时你攻击型魔杖将获得+2法术难度。",
            "3": "+75%你使用的魔杖、卷轴以及其他储法物品的效果，同时你攻击型魔杖将获得+3法术难度。"
        }
    }, "1c": {
        "abil_name": "圣力引导:神圣净化",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "移除目标身上的所有毒素和疾病。同时在目标身上存留一个持续12秒每牧师等级对自然以及魔法毒素免疫的效果。（冷却时间：2s）",
            "2": "移除目标身上的所有毒素、疾病、目盲和诅咒。同时在目标身上存留一个持续12秒每牧师等级对自然以及魔法毒素免疫的效果。（冷却时间：2s）",
            "3": "移除目标身上的所有毒素、疾病、目盲、诅咒、麻痹和石化。同时在目标身上存留一个持续12秒每牧师等级对自然以及魔法毒素免疫的效果。（冷却时间：2s）"
        }
    }, "1d": {
        "abil_name": "天赐",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "每当你使用驱散或圣力引导能力时，你获得每核心3点暂时生命值。",
            "2": "每当你使用驱散或圣力引导能力时，你获得每核心4点暂时生命值。",
            "3": "每当你使用驱散或圣力引导能力时，你获得每核心5点暂时生命值。"
        }
    }, "1e": {
        "abil_name": "无私",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1专注、交涉以及医疗。",
            "2": "+2专注、交涉以及医疗。",
            "3": "+3专注、交涉以及医疗。你获得+10正能量法术强度。"
        }
    }, "2a": {
        "abil_name": "高等驱散",
        "required": 5,
        "prereq": "1a",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你在驱散时视作高于你现在等级1级。这将提升你能驱散的最高生物以及你的驱散伤害。同时，你的驱散伤害提高2",
            "2": "你在驱散时视作高于你现在等级2级。这将提升你能驱散的最高生物以及你的驱散伤害。同时，你的驱散伤害提高4",
            "3": "你在驱散时视作高于你现在等级3级。这将提升你能驱散的最高生物以及你的驱散伤害。同时，你的驱散伤害提高6"
        }
    }, "2b": {
        "abil_name": "强力驱散",
        "required": 5,
        "prereq": "2a",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你成功驱散的不死生物将直接被摧毁。"
        }
    }, "2c": {
        "abil_name": "圣力引导:净化黑魔法",
        "required": 5,
        "prereq": "1c",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "移除目标身上1个有害魔法效果。（冷却时间：6s）",
            "2": "移除目标身上2个有害魔法效果。（冷却时间：6s）",
            "3": "移除目标身上3个有害魔法效果。（冷却时间：6s）"
        }
    }, "2d": {
        "abil_name": "神圣医疗",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的目标收到1D4每两秒的治疗，持续你每点医疗等级2秒。（冷却时间：2s）",
            "2": "你的目标收到2D4每两秒的治疗，持续你每点医疗等级2秒。（冷却时间：2s）",
            "3": "你的目标收到4D4每两秒的治疗，持续你每点医疗等级2秒。（冷却时间：2s）"
        }
    }, "2e": {
        "abil_name": "高效医疗强效",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你使用医疗强效时法力值消耗减少1点。",
            "2": "你使用医疗强效时法力值消耗减少2点。",
            "3": "你使用医疗强效时法力值消耗减少4点。"
        }
    }, "3b": {
        "abil_name": "强力治疗",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你获得+1正能量法术施法者等级。",
            "2": "你获得+2正能量法术施法者等级。",
            "3": "你获得+3正能量法术施法者等级。"
        }
    }, "3c": {
        "abil_name": "不屈天命",
        "required": 10,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "激活：完全治疗你选中的友军目标，移除所有属性伤害、死亡惩罚、负向等级以及目盲、晕眩、耳聋、疾病、力竭、疲乏、弱智、疯狂、反胃、中毒以及震慑状态。（冷却时间：5min）"
        }
    }, "3d": {
        "abil_name": "殉难",
        "required": 10,
        "prereq": "2d",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "开启：当你死亡时，将消耗四发驱散不死生物。所有周围的活体友军以及不死敌军将受到250点正能量医疗以及神圣净化效果。这个治疗效果不被正能量法强影响。（如果你的驱散生物次数不足时，你死亡后不会有任何效果），在死亡之后这个能力将关闭。",
            "2": "开启：当你死亡时，将消耗四发驱散不死生物。所有周围的活体友军以及不死敌军将受到500点正能量医疗以及神圣净化效果。这个治疗效果不被正能量法强影响。（如果你的驱散生物次数不足时，你死亡后不会有任何效果），在死亡之后这个能力将关闭。",
            "3": "开启：当你死亡时，将消耗四发驱散不死生物。所有周围的活体友军以及不死敌军将受到1000点正能量医疗以及神圣净化效果。这个治疗效果不被正能量法强影响。（如果你的驱散生物次数不足时，你死亡后不会有任何效果），在死亡之后这个能力将关闭。"
        }
    }, "3e": {
        "abil_name": "魅力或感知",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1感知",
                "2": "+1魅力"
            }
        }
    }, "4a": {
        "abil_name": "无尽驱散",
        "required": 20,
        "prereq": "2a",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "驱散不死生物每120秒回复一次，如果你已经可以回复驱散次数的话，驱散能力的回复速度将提高10%",
            "2": "驱散不死生物每120秒回复一次，如果你已经可以回复驱散次数的话，驱散能力的回复速度将提高20%",
            "3": "驱散不死生物每120秒回复一次，如果你已经可以回复驱散次数的话，驱散能力的回复速度将提高30%。"
        }
    }, "4b": {
        "abil_name": "惊人医疗",
        "required": 20,
        "prereq": "3b",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你正能量法术的最大施法者等级提高1。",
            "2": "你正能量法术的最大施法者等级提高2。",
            "3": "你正能量法术的最大施法者等级提高3。"
        }
    }, "4c": {
        "abil_name": "神佑健康",
        "required": 20,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你免疫自然、魔法以及超自然疾病。"
        }
    }, "4e": {
        "abil_name": "魅力或感知",
        "required": 20,
        "prereq": "3e",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1感知。",
                "2": "+1魅力。"
            }
        }
    }, "5a": {
        "abil_name": "圣力引导:正能量灵光",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "在你身体外散发出正能量的治疗灵光，可以影响与你牧师等级相同的生物。在灵光内的友军将会获得1+3每牧师等级的治疗效果，不死生物将受到同样的伤害。（冷却：6s）"
                     }
    }, "5b": {
        "abil_name": "治疗专注",
        "required": 30,
        "prereq": "4b",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的治疗xx伤系列法术不再有最大施法者等级。"
        }
    }, "5d": {
        "abil_name": "圣力引导:激活式医疗",
        "required": 30,
        "prereq": "3d",
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你的目标血量掉落在一半以下时，该目标受到250点治疗。每个目标每3分钟只能受到一次激活式医疗（休息将重置这个时间）。这个治疗效果不被正能量法强影响。（冷却时间：6s）"
        }
    } }