this.model.DivineDisciple = {"dID": "DivineDisciple", "name": "圣徒", "index": "646", "translate": "冬日咕咕酱",
    "x1": {
        "abil_name": "神之使徒",
        "required": 0,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：+5负能量和阵营法强。",
                "2": "光明神使：+5光和阵营法强。"
            }
        }
    }, "x2": {
        "abil_name": "神圣防御",
        "required": 5,
        "prereq": "x1",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "+2全豁免。"
        }
    }, "x3": {
        "abil_name": "神圣法术知识",
        "required": 10,
        "prereq": "x2",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：4级法术书里获得：弱能术。",
                "2": "光明神使：3级法术书里获得：太阳束。"
            }
        }
    }, "x4": {
        "abil_name": "神圣法术知识",
        "required": 20,
        "prereq": "x3",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：6级法术书里获得：死灵射线。",
                "2": "光明神使：6级法术书里获得：阳炎射线"
            }
        }
    }, "x5": {
        "abil_name": "神圣法术知识",
        "required": 30,
        "prereq": "x4",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：8级法术书里获得：律令震慑。",
                "2": "光明神使：8级法术书里获得：阳炎爆。"
            }
        }
    }, "x6": {
        "abil_name": "超凡入圣",
        "required": 40,
        "prereq": "x5",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你的光，负能量和火法术获得+1施法者等级以及最大施法者等级。" +
                "</br>黑暗超凡：+2感知，+2全豁免，+5光法术强度。你法术书中添加太阳束，阳炎射线，阳炎爆，以及平衡真言。" +
                "</br>光明超凡：+2感知，+2全豁免，+5负能量法术强度。你法术书中添加弱能术，死灵射线，律令震慑以及平衡真言。"
        }
    }, "1a": {
        "abil_name": "天堂预言",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：寒冰之触(施法消耗:4法力值。冷却时间:6s.)",
                "2": "光明神使：光轮术(施法消耗:4法力值。冷却时间:6s.)"
            },
            "2": {
                "1": "黑暗神使：寒冰之触(施法消耗:3法力值。冷却时间:5s.)",
                "2": "光明神使：光轮术(施法消耗:3法力值。冷却时间:5s.)"
            },
            "3": {
                "1": "黑暗神使：寒冰之触(施法消耗:2法力值。冷却时间:4s.)",
                "2": "光明神使：光轮术(施法消耗:2法力值。冷却时间:4s.)"
            }
        }
    }, "1b": {
        "abil_name": "法术增幅",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "+5光法术强度。",
                "2": "+5负能量强度。",
                "3": "+3通用强度。"
            },
            "2": {
                "1": "+10光法术强度。",
                "2": "+10负能量强度。",
                "3": "+6通用强度。"
            },
            "3": {
                "1": "+15光法术强度。",
                "2": "+15负能量强度。",
                "3": "+9通用强度。"
            }
        }
    }, "1c": {
        "abil_name": "神圣活力",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "为队友回复3d4+10法力值。",
            "2": "为队友回复5d4+10法力值。",
            "3": "为队友回复7d4+10法力值。"
        }
    }, "1d": {
        "abil_name": "法术重击",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光法术获得+2%重击几率",
                "2": "负能量法术获得+2%重击几率",
                "3": "所有法术+1%重击几率"
            }
        }
    }, "1e": {
        "abil_name": "精神力增强",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+30SP",
            "2": "+60SP",
            "3": "+90SP"
        }
    }, "2a": {
        "abil_name": "法术穿透",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "+1法术穿透",
            "2": "+2法术穿透",
            "3": "+3法术穿透"
        }
    }, "2b": {
        "abil_name": "法术增幅",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "+6火法术强度。",
                "2": "+5力场法术强度。",
                "3": "+3通用法术强度。"
            },
            "2": {
                "1": "+12火法术强度。",
                "2": "+10力场法术强度。",
                "3": "+6通用法术强度。"
            },
            "3": {
                "1": "+18火法术强度。",
                "2": "+15力场法术强度。",
                "3": "+9通用法术强度。"
            }
        }
    }, "2c": {
        "abil_name": "高效超魔",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": {
                "1": "强效:施展强效额外耗费的SP减少2",
                "2": "极效:施展极效额外耗费的SP减少3",
                "3": "瞬发:施展瞬发额外耗费的SP减少1",
                "4": "增远:施展增远额外耗费的SP减少1"
            },
            "2": {
                "1": "强效:施展强效额外耗费的SP减少4",
                "2": "极效:施展极效额外耗费的SP减少6",
                "3": "瞬发:施展瞬发额外耗费的SP减少2",
                "4": "增远:施展增远额外耗费的SP减少2"
            },
            "3": {
                "1": "强效:施展强效额外耗费的SP减少6",
                "2": "极效:施展极效额外耗费的SP减少9",
                "3": "瞬发:施展瞬发额外耗费的SP减少4",
                "4": "增远:施展增远额外耗费的SP减少4"
            }
        }
    }, "2d": {
        "abil_name": "法术重击",
        "required": 5,
        "prereq": "1d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光法术获得+2%重击几率",
                "2": "负能量法术获得+2%重击几率",
                "3": "所有法术+1%重击几率"
            }
        }
    }, "2e": {
        "abil_name": "高效超魔",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": {
                "1": "强效:施展强效额外耗费的SP减少2",
                "2": "极效:施展极效额外耗费的SP减少3",
                "3": "瞬发:施展瞬发额外耗费的SP减少1",
                "4": "增远:施展增远额外耗费的SP减少1"
            },
            "2": {
                "1": "强效:施展强效额外耗费的SP减少4",
                "2": "极效:施展极效额外耗费的SP减少6",
                "3": "瞬发:施展瞬发额外耗费的SP减少2",
                "4": "增远:施展增远额外耗费的SP减少2"
            },
            "3": {
                "1": "强效:施展强效额外耗费的SP减少6",
                "2": "极效:施展极效额外耗费的SP减少9",
                "3": "瞬发:施展瞬发额外耗费的SP减少4",
                "4": "增远:施展增远额外耗费的SP减少4"
            }
        }
    }, "3a": {
        "abil_name": "天堂预言",
        "required": 10,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：死灵矢(施法消耗:12法力值。冷却时间:10s.)",
                "2": "光明神使：光轮术(施法消耗:12法力值。冷却时间:106s.)"
            },
            "2": {
                "1": "黑暗神使：死灵矢(施法消耗:9法力值。冷却时间:8s.)",
                "2": "光明神使：光轮术(施法消耗:9法力值。冷却时间:8s.)"
            },
            "3": {
                "1": "黑暗神使：死灵矢(施法消耗:6法力值。冷却时间:6s.)",
                "2": "光明神使：光轮术(施法消耗:6法力值。冷却时间:6s.)"
            }
        }
    }, "3b": {
        "abil_name": "法术增幅",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "+6火法术强度。",
                "2": "+5力场法术强度。",
                "3": "+3通用法术强度。"
            },
            "2": {
                "1": "+12火法术强度。",
                "2": "+10力场法术强度。",
                "3": "+6通用法术强度。"
            },
            "3": {
                "1": "+18火法术强度。",
                "2": "+15力场法术强度。",
                "3": "+9通用法术强度。"
            }
        }
    }, "3c": {
        "abil_name": "高效超模",
        "required": 10,
        "prereq": "2c",
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": {
                "1": "强效:施展强效额外耗费的SP减少2",
                "2": "极效:施展极效额外耗费的SP减少3",
                "3": "瞬发:施展瞬发额外耗费的SP减少1",
                "4": "增远:施展增远额外耗费的SP减少1"
            },
            "2": {
                "1": "强效:施展强效额外耗费的SP减少4",
                "2": "极效:施展极效额外耗费的SP减少6",
                "3": "瞬发:施展瞬发额外耗费的SP减少2",
                "4": "增远:施展增远额外耗费的SP减少2"
            },
            "3": {
                "1": "强效:施展强效额外耗费的SP减少6",
                "2": "极效:施展极效额外耗费的SP减少9",
                "3": "瞬发:施展瞬发额外耗费的SP减少4",
                "4": "增远:施展增远额外耗费的SP减少4"
            }
        }
    }, "3d": {
        "abil_name": "法术重击",
        "required": 10,
        "prereq": "2d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光法术获得+2%重击几率",
                "2": "负能量法术获得+2%重击几率",
                "3": "所有法术+1%重击几率"
            }
        }
    }, "3e": {
        "abil_name": "感知",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "+1感知"
        }
    }, "4a": {
        "abil_name": "天堂预言",
        "required": 20,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：负能量爆发(施法消耗:13法力值。冷却时间:10s.)",
                "2": "光明神使：圣击术(施法消耗:13法力值。冷却时间:10s.)"
            },
            "2": {
                "1": "黑暗神使：负能量爆发(施法消耗:10法力值。冷却时间:8s.)",
                "2": "光明神使：圣击术(施法消耗:10法力值。冷却时间:8s.)"
            },
            "3": {
                "1": "黑暗神使：负能量爆发(施法消耗:7法力值。冷却时间:6s.)",
                "2": "光明神使：圣击术(施法消耗:7法力值。冷却时间:6s.)"
            }
        }
    }, "4b": {
        "abil_name": "法术难度或者法术强度",
        "required": 20,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光明神使：塑能法术难度+1",
                "2": "黑暗神使：死灵法术难度+1",
                "3": "+9通用法术强度"
            }
        }
    }, "4c": {
        "abil_name": "高效超魔:升阶",
        "required": 20,
        "prereq": "3c",
        "passive": true,
        "ranks": 2,
        "AP": 2,
        "abil": {
            "1": "使用法术升阶超魔专长将减少每提升一个等级1点法力值消耗。",
            "2": "使用法术升阶超魔专长将减少每提升一个等级2点法力值消耗。"
        }
    }, "4d": {
        "abil_name": "法术重击",
        "required": 20,
        "prereq": "3d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光法术获得+2%重击几率",
                "2": "负能量法术获得+2%重击几率",
                "3": "所有法术+1%重击几率"
            }
        }
    }, "4e": {
        "abil_name": "感知",
        "required": 20,
        "prereq": "3e",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "+1感知"
        }
    }, "5a": {
        "abil_name": "天堂预言",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "黑暗神使：群体造成中度伤(施法消耗:15法力值。冷却时间:10s.)",
                "2": "光明神使：焰击术(施法消耗:30法力值。冷却时间:20s.)"
            },
            "2": {
                "1": "黑暗神使：群体造成中度伤(施法消耗:12法力值。冷却时间:8s.)",
                "2": "光明神使：焰击术(施法消耗:25法力值。冷却时间:16s.)"
            },
            "3": {
                "1": "黑暗神使：群体造成中度伤(施法消耗:10法力值。冷却时间:6s.)",
                "2": "光明神使：焰击术(施法消耗:20法力值。冷却时间:12s.)"
            }
        }
    }, "5b": {
        "abil_name": "法术难度或者法术强度",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "光明神使:塑能法术难度+1",
                "2": "黑暗神使:死灵法术难度+1",
                "3": "光明神使：+15光法术强度",
                "4": "黑暗神使：+15负能量法术强度",
                "5": "+9通用法术强度"
            }
        }
    }, "5e": {
        "abil_name": "神圣增幅",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "光，负能量和火法术获得+1施法者等级以及最大施法者等级"
        }
    }}