this.model.PaleMaster = {"dID": "PaleMaster", "name": "死灵法师", "index": "476","translate":"Darkmoon",
    "x1": {
        "abil_name": "黑暗收割",
        "required": 0,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "在此天赋树每花费1个点，获得+0.75通用法强和+0.75负能量法强"
        }
    }, "x2": {
        "abil_name": "僵尸囊尸布",
        "required": 5,
        "prereq": "x1",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：你披上僵尸囊尸布，获得负能量吸收和很多僵尸的特性（消耗25点魔法，冷却30秒）" +
                "</br>在这种状态你获得+2力量，+2体质，-2智力，-4魅力，DR5/挥砍；" +
                "</br>空手时增加1W伤害，但你的攻击减少20%；" +
                "</br>你有+100%护命，受负能量治疗，不受正能量或者修理影响，但会受到双倍光伤害，你被认为是不死生物"
        }
    }, "x3": {
        "abil_name": "吸血鬼囊尸布",
        "required": 10,
        "prereq": "x2",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：你披上吸血鬼囊尸布，获得负能量吸收和很多吸血鬼的特性（消耗50点魔法，冷却30秒）" +
                "</br>在这种状态你获得+2力量，+2魅力，+2DC到你的附魔法术，减少25%的攻击和法术仇恨，" +
                "</br>近战物理斩首攻击时：造成目标-1等级；" +
                "</br>你有+100%护命,受负能量治疗，不受正能量或者修理影响，但会受到3倍光伤害，你被认为是不死生物"
        }
    }, "x4": {
        "abil_name": "幽灵囊尸布",
        "required": 20,
        "prereq": "x3",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：你披上幽灵囊尸布，获得负能量吸收和很多幽灵的特性（消耗75点魔法，冷却30秒）" +
                "</br>在这种状态下，你获得25%虚体，羽落效果，+20潜行和平衡技能，物理攻击获得Ghost Touch效果" +
                "</br>近战物理暴击：造成目标1D6体质伤害；" +
                "</br>你有+100%护命，受负能量治疗，不受正能量或者修理影响，但会受到双倍光伤害，你被认为是不死生物"
        }
    }, "x5": {
        "abil_name": "巫妖囊尸布",
        "required": 30,
        "prereq": "x4",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：你披上巫妖囊尸布，获得负能量吸收和很多巫妖的特性（消耗100点魔法，冷却30秒）" +
                "</br>在这种状态下，你获得+4体质，+2智力，+2魅力，+2感知，+1DC到你的死灵学派法术，受到伤害时有机会获得暂时生命" +
                "</br>近战物理攻击：造成2-9点负能量伤害；" +
                "</br>你有+100%护命，受负能量治疗，不受正能量或者修理影响，但会受到双倍光伤害，你被认为是不死生物"
        }
    }, "x6": {
        "abil_name": "死灵君王",
        "required": 40,
        "prereq": "x5",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你获得+2智力，在激活任何1个囊尸布模式时，获得的负能量治疗多5%"
        }
    }, "1a": {
        "abil_name": "死亡之触",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "获得类法能力死亡之触（消耗：2点魔法，冷却：12秒）",
            "2": "获得类法能力死亡之触（消耗：2点魔法，冷却：8秒）",
            "3": "获得类法能力死亡之触（消耗：2点魔法，冷却：4秒）"
        }
    }, "1b": {
        "abil_name": "不死的活力",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "用不死的力量来强化你的肉体，获得10点生命",
            "2": "用不死的力量来强化你的肉体，获得20点生命",
            "3": "用不死的力量来强化你的肉体，获得30点生命"
        }
    }, "1c": {
        "abil_name": "法术暴击：负能量I",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的负能量法术获得+2%的暴击几率"
        }
    }, "1d": {
        "abil_name": "骷髅骑士",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "召唤1个骷髅骑士，骷髅骑士是一个非常强大的战士，他的等价等于你的法师等级加上你的史诗等级，你召唤他之后，仍然可以使用召唤怪物，额外的天赋可以强化骷髅骑士的伤害，攻击速度，移动速度，和防御等级",
            "2": "召唤1个骷髅骑士，骷髅骑士是一个非常强大的战士，他的等价等于你的法师等级加上你的史诗等级，你召唤他之后，仍然可以使用召唤怪物，额外的天赋可以强化骷髅骑士的伤害，攻击速度，移动速度，和防御等级",
            "3": "召唤1个骷髅骑士，骷髅骑士是一个非常强大的战士，他的等价等于你的法师等级加上你的史诗等级，你召唤他之后，仍然可以使用召唤怪物，额外的天赋可以强化骷髅骑士的伤害，攻击速度，移动速度，和防御等级"
        }
    }, "1e": {
        "abil_name": "负能量通道",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你接受负能量的效果增加3%，在你激活了囊尸布模式时，增加你受到的治疗量",
            "2": "你接受负能量的效果增加6%，在你激活了囊尸布模式时，增加你受到的治疗量",
            "3": "你接受负能量的效果增加10%，在你激活了囊尸布模式时，增加你受到的治疗量"
        }
    }, "2b": {
        "abil_name": "高效超魔",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": {
                "1": "强效:施展强效额外耗费的SP减少2",
                "2": "极效:施展极效额外耗费的SP减少3",
                "3": "瞬发:施展瞬发额外耗费的SP减少1",
                "4": "增远:施展增远额外耗费的SP减少1"
            },
            "2": {
                "1": "强效:施展强效额外耗费的SP减少4",
                "2": "极效:施展极效额外耗费的SP减少6",
                "3": "瞬发:施展瞬发额外耗费的SP减少2",
                "4": "增远:施展增远额外耗费的SP减少2"
            },
            "3": {
                "1": "强效:施展强效额外耗费的SP减少6",
                "2": "极效:施展极效额外耗费的SP减少9",
                "3": "瞬发:施展瞬发额外耗费的SP减少4",
                "4": "增远:施展增远额外耗费的SP减少4"
            }

        }
    }, "2c": {
        "abil_name": "法术暴击：负能量II",
        "required": 5,
        "prereq": "1c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的负能量法术获得+2%的暴击几率"
        }
    }, "2d": {
        "abil_name": "尸体工匠",
        "required": 5,
        "prereq": "1d",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的骷髅骑士增加2点亵渎加值（Profane Bonus）力量，敏捷，体质",
            "2": "你的骷髅骑士增加4点亵渎加值（Profane Bonus）力量，敏捷，体质",
            "3": "你的骷髅骑士增加6点亵渎加值（Profane Bonus）力量，敏捷，体质"
        }
    }, "2e": {
        "abil_name": "骨甲",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "在僵尸，吸血鬼，巫妖状态下，获得3点物理抗性；在幽灵状态下，获得1%的躲避",
            "2": "在僵尸，吸血鬼，巫妖状态下，获得6点物理抗性；在幽灵状态下，获得2%的躲避",
            "3": "在僵尸，吸血鬼，巫妖状态下，获得10点物理抗性；在幽灵状态下，获得3%的躲避"
        }
    }, "3a": {
        "abil_name": "死灵矢",
        "required": 10,
        "prereq": "1a",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "获得类法能力死灵矢（消耗5点魔法，冷却15秒）",
            "2": "获得类法能力死灵矢（消耗5点魔法，冷却10秒）",
            "3": "获得类法能力死灵矢（消耗5点魔法，冷却5秒）"
        }
    }, "3b": {
        "abil_name": "夜之斗篷",
        "required": 10,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "激活：减少受到的正能量，负能量，修理，光的效果20%（消耗25点魔法，冷却1秒）",
            "2": "激活：减少受到的正能量，负能量，修理，光的效果35%（消耗25点魔法，冷却1秒）",
            "3": "激活：减少受到的正能量，负能量，修理，光的效果50%（消耗25点魔法，冷却1秒）"
        }
    }, "3c": {
        "abil_name": "法术暴击：负能量III",
        "required": 10,
        "prereq": "2c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的负能量法术获得+2%的暴击几率"
        }
    }, "3d": {
        "abil_name": "无尽奴役",
        "required": 10,
        "prereq": "2d",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的骷髅骑士获得+2亵渎加值AC和+5亵渎加值物理抗性",
            "2": "你的骷髅骑士获得+4亵渎加值AC和+10亵渎加值物理抗性",
            "3": "你的骷髅骑士获得+6亵渎加值AC和+15亵渎加值物理抗性"
        }
    }, "3e": {
        "abil_name": "体质或智力",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1体质",
                "2": "+1智力"
            }
        }

    }, "4c": {
        "abil_name": "法术暴击：负能量II",
        "required": 20,
        "prereq": "3c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的负能量法术获得+2%的暴击几率"
        }
    }, "4d": {
        "abil_name": "黑暗狂热",
        "required": 20,
        "prereq": "3d",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "的骷髅骑士获得15%的双击几率，攻击无视目标5%护命",
            "2": "的骷髅骑士获得30%的双击几率，攻击无视目标10%护命",
            "3": "的骷髅骑士获得45%的双击几率，攻击无视目标15%护命"
        }
    }, "4e": {
        "abil_name": "体质或智力",
        "required": 20,
        "prereq": "3e",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1体质",
                "2": "+1智力"
            }
        }
    }, "5a": {
        "abil_name": "类法术:死灵爆",
        "required": 30,
        "prereq": "3a",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "获得类法能力：死灵爆（消耗10点魔法,冷却18秒）",
            "2": "获得类法能力：死灵爆（消耗10点魔法,冷却12秒）",
            "3": "获得类法能力：死灵爆（消耗10点魔法,冷却6秒）"
        }
    }, "5b": {
        "abil_name": "赋予生命",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "复活一个队友，回复100%生命（冷却5分钟，超魔：瞬发，增远）你的队友被认为是一个僵尸，获得僵尸囊尸布的好处与坏处，随着时间推移，生命慢慢减少，直接腐烂死亡"
        }
    }, "5c": {
        "abil_name": "死灵专精",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "+1DC到你的死灵学派法术"
        }
    }, "5e": {
        "abil_name": "改进囊尸布",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "在僵尸囊尸布形态，获得+2体质，15点物理抗性，10DR/挥砍 " +
                "</br>在吸血鬼囊尸布形态，你获得+2敏捷，你受到光伤害降低到200%，你的近战物理攻击和空手攻击会受到1点负能量治疗" +
                "</br>在幽灵囊尸布形态，你获得+2敏捷，虚体增加到35%" +
                "</br>在巫妖形态，你获得+2智力，+10负能量法强"
        }
    }}