this.model.SeasonHerald = {  "dID": "SeasonHerald", "name": "季节使者", "index":"1054","translate":"冬日咕咕酱",
    "x1": {
        "abil_name": "季节",
        "required": 0,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "在此树中花费的每一点ap都会提供给你1点通用法术强度。" +
                "你跟随着世界上季节的轮回。你获得具现寒冬或者炽夏的能力。" +
                "当夏日来临，你在火、光、音波以及正能量法术上获得+5法术强度。" +
                "凛冬来临时，你在水、酸、地以及电法术上获得5法术强度。" +
                "每一个季节使者的核心天赋都会提高5法术强度，当你拥有六个核心天赋时+30法术强度。" +
                "每个季节持续五分钟，每个季节结束，下个季节就将开始。"
        }
    }, "x2": {
        "abil_name": "时间",
        "required": 5,
        "prereq": "x1",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "+1对应季节的施法者等级。"
        }
    }, "x3": {
        "abil_name": "潮汐",
        "required": 10,
        "prereq": "x2",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "+1对应季节的最大施法者等级。"
        }
    }, "x4": {
        "abil_name": "类法术:阳炎爆",
        "required": 20,
        "prereq": "x3",
        "selected": 0,
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "获得类法术阳炎爆（消耗4法力值。冷却时间26s)"
        }
    }, "x5": {
        "abil_name": "类法术:复仇风暴",
        "required": 30,
        "prereq": "x4",
        "selected": 0,
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "获得类法术复仇风暴（消耗20法力值，冷却2min）"
        }
    }, "x6": {
        "abil_name": "自然祭司",
        "required": 40,
        "prereq": "x5",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你是如此地睿智并且精通使用神圣魔法改变世界的技艺。" +
                "+2感知。你的咒法系法术和变化系法术获得+2DC，+2施法者等级和+2最大施法者等级。" +
                "每当季节更替，你的下个法术将会获得+100%法术重击几率，施法消耗也将会变成十分之一。"
        }
    }, "1a": {
        "abil_name": "魔杖和卷轴精通",
        "required": 1,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "+25%魔杖，卷轴以及其他储法物品的效果。",
            "2": "+50%魔杖，卷轴以及其他储法物品的效果。",
            "3": "+75%魔杖，卷轴以及其他储法物品的效果。"
        }
    }, "1b": {
        "abil_name": "季节问候",
        "required": 1,
        "prereq": null,
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "将季节改变成炽夏或者严冬。（冷却时间:22.5min）",
            "2": "将季节改变成炽夏或者严冬。（冷却时间:15min）",
            "3": "将季节改变成炽夏或者严冬。（冷却时间:7.5min）"
        }
    }, "1c": {
        "abil_name": "消磨",
        "required": 1,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当你攻击或者对敌人施法是，将有50%几率消磨敌人1次，持续3秒。消磨：-2%攻击速度,-2%法术强度。消磨可以叠加25层，每几秒消退一层。每一秒怪物可以被上1层消磨。",
            "2": "当你攻击或者对敌人施法是，将有50%几率消磨敌人0-2次，持续0-6秒。消磨：-2%攻击速度,-2%法术强度。消磨可以叠加25层，每几秒消退一层。每一秒怪物可以被上2层消磨。",
            "3": "当你攻击或者对敌人施法是，将有50%几率消磨敌人0-3次，持续0-9秒。消磨：-2%攻击速度,-2%法术强度。消磨可以叠加25层，每几秒消退一层。每一秒怪物可以被上3层消磨。"
        }
    }, "1d": {
        "abil_name": "盈亏",
        "required": 1,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "对应季节法术获得+2%法术重击几率。"
        }
    }, "1e": {
        "abil_name": "交涉者",
        "required": 1,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1唬骗、交涉、表演以及还价。",
            "2": "+2唬骗、交涉、表演以及还价。",
            "3": "+3唬骗、交涉、表演以及还价。Rank3:+5通用法术强度。"
        }
    }, "2a": {
        "abil_name": "法术穿透",
        "required": 5,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "获得+1法术穿透。",
            "2": "获得+2法术穿透。",
            "3": "获得+3法术穿透。"
        }
    }, "2b": {
        "abil_name": "高效超魔",
        "required": 5,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": {
                "1": "强效:施展强效额外耗费的SP减少2",
                "2": "极效:施展极效额外耗费的SP减少3",
                "3": "瞬发:施展瞬发额外耗费的SP减少1",
                "4": "增远:施展增远额外耗费的SP减少1"
            },
            "2": {
                "1": "强效:施展强效额外耗费的SP减少4",
                "2": "极效:施展极效额外耗费的SP减少6",
                "3": "瞬发:施展瞬发额外耗费的SP减少2",
                "4": "增远:施展增远额外耗费的SP减少2"
            },
            "3": {
                "1": "强效:施展强效额外耗费的SP减少6",
                "2": "极效:施展极效额外耗费的SP减少9",
                "3": "瞬发:施展瞬发额外耗费的SP减少4",
                "4": "增远:施展增远额外耗费的SP减少4"
            }
        }
    }, "2c": {
        "abil_name": "类法术:制造火焰",
        "required": 5,
        "prereq": "1c",
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "制造火焰。(消耗:6法力值。冷却时间：12s)",
            "2": "制造火焰。(消耗:5法力值。冷却时间：10s)",
            "3": "制造火焰。(消耗:3法力值。冷却时间：8s)"
        }
    }, "2d": {
        "abil_name": "盈亏",
        "required": 5,
        "prereq": "1d",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "对应季节法术获得+2%法术重击几率。"
        }
    }, "2e": {
        "abil_name": "行动提升:法术强度",
        "required": 5,
        "prereq": null,
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "激活在20秒内获得10点行动提升加值的通用法术强度。",
            "2": "激活在20秒内获得20点行动提升加值的通用法术强度。",
            "3": "激活在20秒内获得30点行动提升加值的通用法术强度。"
        }
    }, "3a": {
        "abil_name": "自然守护者",
        "required": 10,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你是自然秩序的守护者。异怪和不死生物在受到你的攻击法术时将额外受到1d6破敌伤害。" +
                "这个额外伤害每一秒只对一个怪物产生一次效果。（可以被法术强度影响）这个效果只对纯粹的攻击法术有效。" +
                "像治疗轻伤一样既可以治疗队友又可以伤害不死生物的法术不受此天赋的影响。",
            "2": "你是自然秩序的守护者。异怪和不死生物在受到你的攻击法术时将额外受到2d6破敌伤害。" +
                "这个额外伤害每一秒只对一个怪物产生一次效果。（可以被法术强度影响）这个效果只对纯粹的攻击法术有效。" +
                "像治疗轻伤一样既可以治疗队友又可以伤害不死生物的法术不受此天赋的影响。",
            "3": "你是自然秩序的守护者。异怪和不死生物在受到你的攻击法术时将额外受到4d6破敌伤害。" +
                "这个额外伤害每一秒只对一个怪物产生一次效果。（可以被法术强度影响）这个效果只对纯粹的攻击法术有效。" +
                "像治疗轻伤一样既可以治疗队友又可以伤害不死生物的法术不受此天赋的影响。"
        }
    }, "3b": {
        "abil_name": "高效超魔:升阶",
        "required": 10,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 2,
        "AP": 2,
        "abil": {
            "1": "施展升阶额外耗费的SP减少1",
            "2": "施展升阶额外耗费的SP减少2"
        }
    }, "3c": {
        "abil_name": "类法术:爬行冰寒",
        "required": 10,
        "prereq": "2c",
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "爬行冰寒（消耗：6法力值。冷却时间：12s)",
            "2": "爬行冰寒（消耗：5法力值。冷却时间：10s)",
            "3": "爬行冰寒（消耗：3法力值。冷却时间：8s)"
        }
    }, "3d": {
        "abil_name": "盈亏",
        "required": 10,
        "prereq": "2d",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "对应季节法术获得+2%法术重击几率"
        }
    }, "3e": {
        "abil_name": "属性增强:感知",
        "required": 10,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "+1感知"
        }
    }, "4a": {
        "abil_name": "春之复苏",
        "required": 20,
        "prereq": null,
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "将春天的活力注入一个队友体内。当被注入的队友低于50%生命值时，这个队友和其他友军将会受到20D6的治疗，并在攻击上获得+2原始加值。（持续5分钟直到被激活）（消耗8法力值，冷却时间：8s）",
            "2": "将春天的活力注入一个队友体内。当被注入的队友低于50%生命值时，这个队友和其他友军将会受到20D6的治疗，并在攻击上获得+2原始加值。（持续5分钟直到被激活）（消耗6法力值，冷却时间：6s）",
            "3": "将春天的活力注入一个队友体内。当被注入的队友低于50%生命值时，这个队友和其他友军将会受到20D6的治疗，并在攻击上获得+2原始加值。（持续5分钟直到被激活）（消耗4法力值，冷却时间：4s）"
        }
    },"4b": {
        "abil_name": "秋之低语",
        "required": 20,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的低语将萦绕在目标脑海中，在他们心中注入腐化之语。你的酸/负能量/电法术将有10%几率对目标造成颤栗效果。（对raid boss有效，不同来源可以叠加。）",
            "2": "你的低语将萦绕在目标脑海中，在他们心中注入腐化之语。你的酸/负能量/电法术将有20%几率对目标造成颤栗效果。（对raid boss有效，不同来源可以叠加。）",
            "3": "你的低语将萦绕在目标脑海中，在他们心中注入腐化之语。你的酸/负能量/电法术将有40%几率对目标造成颤栗效果。（对raid boss有效，不同来源可以叠加。）"
        }
    }, "4c": {
        "abil_name": "类法术:召雷术",
        "required": 20,
        "prereq": "3c",
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "召雷术（消耗10法力值。冷却时间12s）",
            "2": "召雷术（消耗8法力值。冷却时间10s）",
            "3": "召雷术（消耗6法力值。冷却时间8s）"
        }
    }, "4d": {
        "abil_name": "盈亏",
        "required": 20,
        "prereq": "3d",
        "selected": 0,
        "passive": true,
        "ranks":1,
        "AP": 2,
        "abil": {
            "1": "对应季节法术获得+2%法术重击几率。"
        }
    }, "4e": {
        "abil_name": "属性增强:感知",
        "required": 20,
        "prereq": "3e",
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "+1感知"
        }
    }, "5a": {
        "abil_name": "盛夏之冠",
        "required": 30,
        "prereq": null,
        "selected": 0,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你选择的目标将充满夏日的光辉和活力。目标获得+15%增强加值的治疗放大，他/她的武器将会造成 2d6额外光伤害。你只能同时为一人加冕。武器附魔只能存在一个。（消耗1法力值，冷却6s)"
        }
    }, "5b": {
        "abil_name": "凛冬之心",
        "required": 30,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你代表了冬日无法阻挡的严寒以及生命的终结。你的冰法术将有5%几率触发以你为中心的突然的冰雪爆，造成1d10+30点寒冷伤害。"
        }
    }, "5c": {
        "abil_name": "类法术:平衡真言",
        "required": 30,
        "prereq": "4c",
        "selected": 0,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "平衡真言（消耗：12法力值。冷却时间25s)",
            "2": "平衡真言（消耗：9法力值。冷却时间20s)",
            "3": "平衡真言（消耗：6法力值。冷却时间15s)"
        }
    }, "5d": {
        "abil_name": "时间与潮汐",
        "required": 30,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP":2,
        "abil": {
            "1": "你对应的季节法术获得+1施法者等级和最大施法者等级。"
        }
    }, "5e": {
        "abil_name": "至日之力",
        "required": 30,
        "prereq": null,
        "selected": 0,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的塑能系法术和变化系法术获得+1DC."
        }
    }}
