this.model.Tempest = {"dID": "Tempest", "name": "暴风游侠", "index": "544", "translate": "Arcatta",
    "x1": {
        "abil_name": "旋铁盾",
        "required": 0,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "双持时，你获得+2 AC，盾牌加值，每当你习得新的暴风游侠核心能力，该加值+1，最大+7"
        }
    }, "x2": {
        "abil_name": "暴风",
        "required": 5,
        "prereq": "x1",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "双持时,你获得+20%副手触发率，你视弯刀为轻武器，你所持的所有轻武器可以用敏捷调整值来计算命中"
        }
    }, "x3": {
        "abil_name": "致命优雅",
        "required": 10,
        "prereq": "x2",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "双持时，你所持的所有轻武器可以用敏捷调整值来计算伤害"
        }
    }, "x4": {
        "abil_name": "拨挡箭矢",
        "required": 20,
        "prereq": "x3",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "双持时，你获得拨挡箭矢专长（你可以击落将要命中你的发射物，如箭矢，每6秒触发一次），你同时获得额外+10%副手触发率"
        }
    }, "x5": {
        "abil_name": "旋风",
        "required": 30,
        "prereq": "x4",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "双持时，你获得+5%双击率"
        }
    }, "x6": {
        "abil_name": "狂舞者",
        "required": 40,
        "prereq": "x5",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "+2敏捷；双持时，你获得+25%副手双击率"
        }
    }, "1a": {
        "abil_name": "装备防护",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你有25%几率防止物品受损",
            "2": "你有50%几率防止物品受损",
            "3": "你有75%几率防止物品受损"
        }
    }, "1b": {
        "abil_name": "精通反射",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你获得+1反射豁免和额外+1对抗陷阱的反射豁免",
            "2": "你获得+2反射豁免和额外+2对抗陷阱的反射豁免",
            "3": "你获得+3反射豁免和额外+3对抗陷阱的反射豁免"
        }
    }, "1c": {
        "abil_name": "精通防御",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的旋铁盾核心能力赋予你额外+1 AC，拨挡箭矢专长将每4秒触发一次",
            "2": "你的旋铁盾核心能力赋予你额外+2 AC，拨挡箭矢专长将每3秒触发一次",
            "3": "你的旋铁盾核心能力赋予你额外+3 AC，拨挡箭矢专长将每2秒触发一次"
        }
    }, "1d": {
        "abil_name": "旋风刃",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "双持时，+1命中和伤害"
        }
    }, "1e": {
        "abil_name": "警觉",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1平衡、跳跃和翻滚，翻滚时，+2 AC",
            "2": "+2平衡、跳跃和翻滚，翻滚时，+4 AC",
            "3": "+3平衡、跳跃和翻滚，翻滚时，+6 AC"
        }
    }, "2a": {
        "abil_name": "精通招架",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "双持时，你获得+3PR",
            "2": "双持时，你获得+6PR",
            "3": "双持时，你获得+10PR"
        }
    }, "2b": {
        "abil_name": "精通闪避",
        "required": 5,
        "prereq": "1b",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "着轻甲或者无甲时，+1%闪避",
            "2": "着轻甲或者无甲时，+2%闪避",
            "3": "着轻甲或者无甲时，+3%闪避"
        }
    }, "2c": {
        "abil_name": "血光击：近战攻击",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1[W]，造成伤害时，使目标流血，此流血效果可以叠加5次，CD6秒",
            "2": "+2[W]，造成伤害时，使目标流血，此流血效果可以叠加5次，CD6秒",
            "3": "+3[W]，造成伤害时，使目标流血，此流血效果可以叠加5次，CD6秒"
        }
    }, "2d": {
        "abil_name": "旋风刃",
        "required": 5,
        "prereq": "1d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "双持时，+1命中和伤害"
        }
    }, "2e": {
        "abil_name": "行动提升",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": {
                "1": "攻速提升：+10%攻速，持续20秒",
                "2": "游侠疾跑：+30%跑速，持续20秒"
            },
            "2": {
                "1": "攻速提升：+20%攻速，持续20秒",
                "2": "游侠疾跑：+40%跑速，持续20秒"
            },
            "3":{
                "1": "攻速提升：+30%攻速，持续20秒",
                "2": "游侠疾跑：+50%跑速，持续20秒"
            }
        }
    }, "3a": {
        "abil_name": "居合命中",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1重击确认",
            "2": "+2重击确认",
            "3": "+3重击确认"
        }
    }, "3b": {
        "abil_name": "精通灵活移动",
        "required": 10,
        "prereq": "2b",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "着轻甲或者无甲时，+1最大敏捷加值和闪避上限，-1护甲检定惩罚",
            "2": "着轻甲或者无甲时，+2最大敏捷加值和闪避上限，-2护甲检定惩罚",
            "3": "着轻甲或者无甲时，+3最大敏捷加值和闪避上限，-3护甲检定惩罚"
        }
    },  "3d": {
        "abil_name": "旋风刃",
        "required": 10,
        "prereq": "2d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "双持时，+1命中和伤害"
        }
    }, "3e": {
        "abil_name": "属性提升",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1敏捷"
            }
        }
    }, "4a": {
        "abil_name": "居合伤害",
        "required": 20,
        "prereq": "3a",
        "passive": true,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "+1重击伤害",
            "2": "+2重击伤害",
            "3": "+3重击伤害"
        }
    }, "4b": {
        "abil_name": "乾坤大挪移",
        "required": 20,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "近战双持攻击：攻击一个目标，在接下来的5秒内，每当你伤害一个目标，你获得+2%闪避持续5秒，此闪避效果可叠加15次，CD1分钟",
            "2": "近战双持攻击：攻击一个目标，在接下来的10秒内，每当你伤害一个目标，你获得+2%闪避持续5秒，此闪避效果可叠加15次，CD1分钟",
            "3": "近战双持攻击：攻击一个目标，在接下来的15秒内，每当你伤害一个目标，你获得+2%闪避持续5秒，此闪避效果可叠加15次，CD1分钟"
        }
    }, "4c": {
        "abil_name": "风暴来袭",
        "required": 20,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "近战双持攻击：攻击一个目标，在接下来的5秒内，每当你伤害一个目标，你获得+1伤害和-2AC持续5秒，此闪避效果可叠加10次，CD2分钟",
            "2": "近战双持攻击：攻击一个目标，在接下来的10秒内，每当你伤害一个目标，你获得+1伤害和-2AC持续5秒，此闪避效果可叠加10次，CD2分钟",
            "3": "近战双持攻击：攻击一个目标，在接下来的15秒内，每当你伤害一个目标，你获得+1伤害和-2AC持续5秒，此闪避效果可叠加10次，CD2分钟"
        }
    }, "4d": {
        "abil_name": "旋风刃",
        "required": 20,
        "prereq": "3d",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "双持时，+1命中和伤害"
        }
    }, "4e": {
        "abil_name": "属性提升",
        "required": 20,
        "prereq": "3e",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1敏捷"
            }
        }
    },   "5b": {
        "abil_name": "闪避之舞",
        "required": 30,
        "prereq": "4b",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "提升你的反射闪避专长，每当你反射豁免失败的时候，你只受到85%的伤害",
            "2": "提升你的反射闪避专长，每当你反射豁免失败的时候，你只受到70%的伤害",
            "3": "提升你的反射闪避专长，每当你反射豁免失败的时候，你只受到50%的伤害"
        }
    }, "5c": {
        "abil_name": "千刀击",
        "required": 30,
        "prereq": "4c",
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "双持攻击时 +1[W]，你获得+30%双击率持续6秒，CD2分钟",
            "2": "双持攻击时 +3[W]，你获得+60%双击率持续6秒，CD2分钟",
            "3": "双持攻击时 +5[W]，你获得+90%双击率持续6秒，CD2分钟"
        }
    }, "5d": {
        "abil_name": "死亡之舞",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 2,
        "abil": {
            "1": "近战双持攻击：+1[W]，你的攻击可以同时击打2个目标持续6秒，CD1分钟	",
            "2": "近战双持攻击：+3[W]，你的攻击可以同时击打3个目标持续6秒，CD1分钟	",
            "3": "近战双持攻击：+5[W]，你的攻击可以同时击打4个目标持续6秒，CD1分钟	"
        }
    } }