this.model.Warpriest = {"dID": "Warpriest", "name": "战争祭祀", "index": "680", "translate": "冬日咕咕酱",
    "x1": {
        "abil_name": "惩戒击",
        "required": 0,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：重击你的敌人，造成额外2[W]伤害。（冷却时间：15s)" +
                "</br>被动：+2AC。+5火法术强度。+5光法术强度。"
        }
    }, "x2": {
        "abil_name": "战斗适应力",
        "required": 5,
        "prereq": "x1",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "被动：5/-伤害减免。+2AC。+5火法术强度。+5光法术强度"
        }
    }, "x3": {
        "abil_name": "圣域术",
        "required": 10,
        "prereq": "x2",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活:你获得+20神圣加值的物理抵抗率（PRR），持续20s。（激活消耗：10法力值。冷却：1min）。" +
                "</br>被动：+2AC。+5火法术强度。+5光法术强度。"
        }
    }, "x4": {
        "abil_name": "战争领域：朦胧术",
        "required": 20,
        "prereq": "x3",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "朦胧术：你将朦胧术添加到你牧师法术书2级法术中。另外，你获得永久的朦胧术效果。" +
                "</br>被动：+2AC。+5火法术强度。+5光法术强度。"
        }
    }, "x5": {
        "abil_name": "战争领域：加速术",
        "required": 30,
        "prereq": "x4",
        "passive": true,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "你将加速术添加到你牧师法术书3级法术中。 " +
                "</br>被动：+2AC。+5火法术强度。+5光法术强度。"
        }
    }, "x6": {
        "abil_name": "死敌",
        "required": 40,
        "prereq": "x5",
        "passive": false,
        "ranks": 1,
        "AP": 1,
        "abil": {
            "1": "激活：你和你周围的友军获得100点暂时生命值，他们的攻击将造成10%额外伤害。在18秒内，在范围内的友军将每3秒刷新一次效果，那些离开范围的友军的身上的效果将只持续5秒。（冷却：5min）" +
                "</br>被动：神圣化身在获得20层圣途之后就会激活，取代原有的25层。" +
                "+2体质。+2AC。+5火法术强度。+5光法术强度。"        }
    }, "1a": {
        "abil_name": "神力",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你获得与你魅力调整相同的洞察力量加值，持续30秒。（激活花费：21法力值。冷却：20s)",
            "2": "你获得与你魅力调整相同的洞察力量加值，持续60秒。（激活花费：18法力值。冷却：20s)",
            "3": "你获得与你魅力调整相同的洞察力量加值，持续120秒。（激活花费：15法力值。冷却：20s)"
        }
    }, "1b": {
        "abil_name": "健壮",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+5最大生命值。",
            "2": "+10最大生命值。",
            "3": "+15最大生命值。"
        }
    }, "1c": {
        "abil_name": "正义武器",
        "required": 1,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你装备你神祗的偏爱武器时，武器将获得+1附魔加值。"
        }
    }, "1d": {
        "abil_name": "神圣之触",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当你治疗友军时，他们获得持续12s的1AC以及1PRR。",
            "2": "当你治疗友军时，他们获得持续12s的2AC以及2PRR。",
            "3": "当你治疗友军时，他们获得持续12s的3AC以及3PRR。"
        }
    }, "1e": {
        "abil_name": "警觉",
        "required": 1,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+1聆听，搜索和侦察。",
            "2": "+2聆听，搜索和侦察。",
            "3": "+3聆听，搜索和侦察。Rank3:+1对陷阱豁免。"
        }
    }, "2a": {
        "abil_name": "弱点重击",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你用惩戒击命中敌人时，他们获得4-7层易伤。（每层易伤使敌人受到额外1%伤害，持续3秒。这个效果可以叠加20层。）"
        }
    }, "2b": {
        "abil_name": "钢铁之墙",
        "required": 5,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "+3PRR",
            "2": "+6PRR",
            "3": "+10PRR"
        }
    }, "2c": {
        "abil_name": "正义武器",
        "required": 5,
        "prereq": "1c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你装备你神祗的偏爱武器时，武器将获得+1附魔加值。"
        }
    }, "2d": {
        "abil_name": "神怒:行动提升",
        "required": 5,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你和周围的友军获得+2行动提升加值的AC，AB以及伤害。（持续：30s，冷却1min）",
            "2": "你和周围的友军获得+3行动提升加值的AC，AB以及伤害。（持续：30s，冷却1min）",
            "3": "你和周围的友军获得+4行动提升加值的AC，AB以及伤害。（持续：30s，冷却1min）"
        }
    }, "2e": {
        "abil_name": "神怒：豁免",
        "required": 5,
        "prereq": "2d",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "你的神怒将提供+2行动提升加值的豁免。",
            "2": "你的神怒将提供+3行动提升加值的豁免。",
            "3": "你的神怒将提供+4行动提升加值的豁免。"
        }
    },  "3b": {
        "abil_name": "罪负担",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当你被击中时，10%几率给予对手一层原罪负担。（原罪负担：-1力量和敏捷，可以叠加10次）",
            "2": "当你被击中时，30%%几率给予对手一层原罪负担。（原罪负担：-1力量和敏捷，可以叠加10次）",
            "3": "当你被击中时，45%几率给予对手一层原罪负担。（原罪负担：-1力量和敏捷，可以叠加10次）"
        }
    }, "3c": {
        "abil_name": "正义武器",
        "required": 10,
        "prereq": "2c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你装备你神祗的偏爱武器时，武器将获得+1附魔加值。"
        }
    }, "3d": {
        "abil_name": "神怒：能量吸收",
        "required": 10,
        "prereq": "2d",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "神怒将提供5%酸、电、寒冷、火以及音波元素吸收。",
            "2": "神怒将提供10%酸、电、寒冷、火以及音波元素吸收。",
            "3": "神怒将提供15%酸、电、寒冷、火以及音波元素吸收。"
        }
    }, "3e": {
        "abil_name": "感知、力量或魅力",
        "required": 10,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1感知",
                "3": "+1魅力"
            }
        }
    }, "4a": {
        "abil_name": "改善攻击",
        "required": 20,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP":2,
        "abil": {
            "1": "当你用惩戒击命中敌人时，你和你周围的友军将收到1d2每角色等级的医疗、以及次级复原术的效果。（治疗效果受正能量法术强度的影响）"
        }
    }, "4b": {
        "abil_name": "光守护",
        "required": 20,
        "prereq": "3b",
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "攻击你的敌人受到1D4光伤害。",
            "2": "攻击你的敌人受到2D4光伤害。",
            "3": "攻击你的敌人受到3D4光伤害。"
        }
    }, "4c": {
        "abil_name": "正义武器",
        "required": 20,
        "prereq": "3c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你装备你神祗的偏爱武器时，武器将获得+1附魔加值。"
        }
    },   "4e": {
        "abil_name": "感知、力量或魅力",
        "required": 20,
        "prereq": "3e",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": {
                "1": "+1力量",
                "2": "+1感知",
                "3": "+1魅力"
            }
        }
    }, "5a": {
        "abil_name": "神力",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "你的神祗将力量与战斗技艺注入你的身体，提供给你+6增强加值的力量，你的基础攻击加值等同于你的等级。"
        }
    }, "5b": {
        "abil_name": "神圣化身",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当开启时，你的攻击将产生一层圣途。当圣途到达25层时，圣途将被移除，周围的敌人将受到1D4光和1D4火伤害每角色等级。（神圣化身造成的伤害受火和光法术强度影响）" +
                "你每3秒只能获得1层圣途。如果你有死敌核心天赋，神圣化身将在圣途到达20层时激活。",
            "2": "当开启时，你的攻击将产生一层圣途。当圣途到达25层时，圣途将被移除，周围的敌人将受到1D4光和1D4火伤害每角色等级。（神圣化身造成的伤害受火和光法术强度影响）" +
                "你每2秒只能获得1层圣途。如果你有死敌核心天赋，神圣化身将在圣途到达20层时激活。",
            "3": "当开启时，你的攻击将产生一层圣途。当圣途到达25层时，圣途将被移除，周围的敌人将受到1D4光和1D4火伤害每角色等级。（神圣化身造成的伤害受火和光法术强度影响）" +
                "你每秒只能获得1层圣途。如果你有死敌核心天赋，神圣化身将在圣途到达20层时激活。"
        }
    }, "5c": {
        "abil_name": "神怒武器",
        "required": 30,
        "prereq": "4c",
        "passive": true,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "当你装备你神祗的偏爱武器时，武器将获得+1附魔加值。当你造成一次斩首击时，你的攻击将在6秒内附带3D4光伤害。"
        }
    }, "5d": {
        "abil_name": "魔法反击",
        "required": 30,
        "prereq": null,
        "passive": true,
        "ranks": 3,
        "AP": 1,
        "abil": {
            "1": "当敌人用法术伤害你时，有10%几率他们将被击倒。",
            "2": "当敌人用法术伤害你时，有20%几率他们将被击倒。",
            "3": "当敌人用法术伤害你时，有30%几率他们将被击倒。"
        }
    }, "5e": {
        "abil_name": "神圣干涉",
        "required": 30,
        "prereq": null,
        "passive": false,
        "ranks": 1,
        "AP": 2,
        "abil": {
            "1": "为你的目标防护致命伤害。被保护的目标的生命值无法低于-9,当被保护的目标瘫痪倒地时，这个效果将在几秒后医疗目标10-39，然后消失。（激活消耗：30法力值。冷却时间：2min）"
        }
    }}